Тестовая_база_ERP_14/src/Catalogs/ПоказателиБюджетов/ПоказателиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиБюджетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресАналитикиКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаВалюты</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаЕдиницыИзмерения</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОпределяетсяАналитикой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресАналитикиВалюта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики1</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики2</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики3</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики4</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики5</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияОпределяетсяАналитикой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитики6</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АналитикиСтатейБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИспользуемыхАналитик</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПоКоличеству</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипПоказателяБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаСтатейИПоказателейБюджетов</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/ПоказателиБюджетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает имена блокируемых реквизитов для механизма блокирования реквизитов БСП.
// 
// Возвращаемое значение:
// 	Массив - имена блокируемых реквизитов:
//		* БлокируемыйРеквизит - Строка - Имя блокируемого реквизита.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("ВидАналитики1");
	Результат.Добавить("ВидАналитики2");
	Результат.Добавить("ВидАналитики3");
	Результат.Добавить("ВидАналитики4");
	Результат.Добавить("ВидАналитики5");
	Результат.Добавить("ВидАналитики6");
	Результат.Добавить("УчитыватьПоКоличеству");
	Результат.Добавить("УчитыватьПоВалюте");
	Результат.Добавить("ТипПоказателя");
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//++ НЕ УТ
	Отчеты.ОборотноСальдоваяВедомостьБюджетирования.ДобавитьКомандуОтчета(КомандыОтчетов);
	//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
